Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཁྱོད་ཀྱིས་དགོངས་པ་རྫོགས་ཏེ་དུས་ལ་ད་བབ་ཀྱིས།
en: Now the time has come for your wishes to be fulfilled;

source: །ཤིང་དབང་དྲུང་དུ་གཤེགས་ཏེ་བྱང་ཆུབ་མཆོག་རེག་མཛོད།
en: So go to the lord of trees and connect with supreme awakening.”

source: །དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་འདི་སྙམ་དུ་བསམས་ཏེ། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཅི་ཞིག་ལ་བཞུགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སྙམ་མོ། །དེ་ནས་དེས་ཡང་འདི་སྙམ་དུ་བསམས་ཏེ།
en: Monks, the Bodhisattva then thought to himself, “Where did the previous thus-gone ones sit when they attained unsurpassed, genuine and perfect awakening?

source: རྩྭ་བཏིང་ནས་བཞུགས་སོ་སྙམ་མོ།
en: They sat on a bed of grass!”

source: །དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་ཚོགས་བརྒྱ་སྟོང་བར་སྣང་ལ་འཁོད་པ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: At that point hundreds of thousands of gods from the pure realms descended into the atmosphere. They knew the Bodhisattva’s thoughts and said:

source: །དེ་དེ་བཞིན་ནོ།
en: “Yes, that is how it is.

source: །སྐྱེས་བུ་དམ་པ་དེ་དེ་བཞིན་ཏེ།
en: Holy Man, that is correct.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་རྩྭ་བཏིང་བ་ལ་བཞུགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: The previous thus-gone ones used a seat of grass as they attained unsurpassed, genuine and perfect awakening.”

source: དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔས་ལམ་གྱི་གཡས་རོལ་ན་རྩྭ་འཚོང་བཀྲ་ཤིས་པ་ཞེས་བྱ་བ་རྩྭ་སྔོ་བ། འཇམ་པ། ཤིན་ཏུ་གཞོན་པ། ཉམས་དགའ་བ། ལྕང་ལོར་འཁྲིལ་བར་འདུག་པ། གཡས་སུ་འཁྱིལ་བ། རྨ་བྱའི་མགྲིན་པ་ལྟ་བུ། ཀ་ཙ་ལིན་དའི་གོས་ལྟར་རེག་ན་བདེ་བ། དྲི་རབ་ཏུ་ཞིམ་པ། ཁ་དོག་དང་ལྡན་པ། ཡིད་དུ་འོང་བ་དག་བརྔ་ཞིང་འདུག་པ་མཐོང་ངོ་།
en: Monks, at the right side of the road the Bodhisattva now noticed a grass seller, whose name was Svastika, who was busy cutting grass. The grass was green, soft, fresh, and beautiful. It coiled to the right and resembled the neck of a peacock. It was as soft to the touch as divine cloth, with the sweetest scent and the most beautiful color.

source: །མཐོང་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་ལམ་བོར་ཏེ། རྩྭ་འཚོང་བཀྲ་ཤིས་པ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། རྩྭ་འཚོང་བཀྲ་ཤིས་པ་ལ་སྙན་པའི་ཚིག་གིས་སྨྲས་ཏེ། ཚིག་དེ་ནི་ཀུན་ཤེས་པར་བྱེད་པ་དང་། རྣམ་པར་ཤེས་པར་བྱེད་པ་དང་། རྣམ་པར་གསལ་བ་དང་། མི་ཆོད་པ་དང་། ཆགས་པར་བྱེད་པ་དང་། སྙན་ཅིང་འཇེབས་པ་དང་། མཉན་པར་འོས་པ་དང་། སྣུམ་པ་དང་། གོ་བར་བྱེད་པ་དང་། སྐུལ་བ་དང་། ཚིམ་པར་བྱེད་པ་དང་། དགའ་བར་བྱེད་པ་དང་། མི་རྩུབ་པ་དང་། ཤ་ཤ་བོ་མ་ཡིན་པ་དང་། མི་བརླང་བ་དང་། མི་བརྐམ་པ་དང་། འཇམ་པ་དང་། སྙན་པ་དང་། རྣར་བདེ་བ་དང་། ལུས་དང་སེམས་ཤིན་ཏུ་དགའ་བར་བྱེད་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་དང་འཐབ་པ་དང་། རྙོག་པ་སེལ་བ་དང་། ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་ལྟ་བུ་དང་། བྱ་ཀུ་ན་ལ་དང་། ཤང་ཤང་ཏེའུ་ལ་སོགས་པ་སྒྲ་འབྱིན་པའི་ང་རོ་ལྟ་བུ་དང་།
en: At this sight the Bodhisattva left the road, and he went to the grass seller Svastika and spoke to him with sweet words. His words were authoritative, informative, and clear. His speech was uninterrupted, captivating, and pleasant to hear. It was affectionate, worthy to be remembered, encouraging, satisfying, and delightful. His words were not harsh. They were free from stammering, and they had no animosity. They were not erratic but smooth, gentle, sweet, and pleasant to the ear. It was a speech that delighted both the body and the mind and cleared away all attachment, anger, delusion, strife, and quarrels. His voice was like the call of the cuckoo bird, the kunāla bird, and the partridge.

source: རྔ་བོ་ཆེ་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་སྐད་ཀྱི་ང་རོ་དང་ལྡན་པ་དང་།
en: It sounded like a drum or a melodious chant.

source: གནོད་པ་མེད་པ་དང་། བདེན་པ་དང་། གསལ་བ་དང་། ཡང་དག་པ་དང་། ཚངས་པའི་སྒྲ་སྐད་བསྒྲགས་པའི་གདངས་ལྟ་བུ་དང་། རྒྱ་མཚོའི་སྒྲའི་ཤུགས་ལྟ་བུ་དང་། རི་རྡོབ་པའི་སྒྲ་ལྟ་བུ་དང་ལྡན་པ་དང་།
en: It caused no harm but was true, clear, and genuine. His voice had a resonance like the voice of Brahmā, or the gushing of waves on the ocean, or the sound of rocks hitting against each other.

source: ལྷའི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོས་མངོན་པར་བསྟོད་པ་དང་། ཟབ་པ་དང་། གཏིང་དཔག་དཀའ་བ་དང་།
en: It was a voice praised by the lord of the gods and the lord of the demigods. It was hard to measure its profundity and depth.

source: བདུད་ཀྱི་སྟོབས་སྟོབས་མེད་པར་བྱེད་པ་དང་། ཕས་ཀྱི་རྒོལ་བའི་སྨྲ་བ་འཇོམས་པ་དང་།
en: It rendered powerful demons powerless and eliminated opposing doctrines.

source: སེང་གེའི་སྒྲའི་ཤུགས་ལྟ་བུ་དང་། རྟ་དང་གླང་པོ་ཆེའི་སྒྲ་འབྱིན་པའི་ང་རོ་ལྟ་བུ་དང་། ཀླུ་སྒྲ་སྒྲོག་པ་ལྟ་བུ་དང་། འབྲུག་ཟེར་བའི་སྒྲ་ལྟ་བུ་དང་། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དང་།
en: He spoke with the strength of the lion’s roar, the neighing of a horse, the trumpeting of an elephant, and with a voice resounding like that of a nāga. His voice was like the clapping of a thundercloud, pervading all buddha realms in the ten directions.

source: འདུལ་བའི་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་དང་། རྟབ་རྟབ་པོར་མ་ཡིན་པ་དང་། འཚེ་བ་མེད་པ་དང་། མི་ཤོལ་པ་དང་། འཚམ་པ་དང་། རིགས་པ་དང་། དུས་སུ་སྨྲ་བ་དང་། དུས་ལས་མི་ཡོལ་བ་དང་། ཆོས་བརྒྱ་སྟོང་ལེགས་པར་བརྒྱུས་པ་དང་། མཉེན་པ་དང་། ཐོགས་པ་མེད་པ་དང་། རྒྱུན་ཆད་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་པ་དང་། སྐད་ཅིག་གིས་སྐད་ཐམས་ཅད་སྒྲོགས་པ་དང་། བསམ་པ་ཐམས་ཅད་ཤེས་པར་བྱེད་པ་དང་། བདེ་བ་ཐམས་ཅད་སྐྱེད་པ་དང་། ཐར་པའི་ལམ་ཡང་དག་པར་སྟོན་པ་དང་། ལམ་གྱི་ཚོགས་སྨྲ་བ་དང་། འཁོར་ལས་མི་འདའ་བ་དང་། འཁོར་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་དང་འཐུན་པ་སྟེ།
en: It roused all sentient beings in need of guidance. It was unconfused, harmless, and without hesitation. It was appropriate, logical, spoken at the right time, in a timely manner, and contained hundreds of thousands of teachings. It was smooth, unimpeded, and with uninterrupted eloquence. He spoke with a single voice, yet was heard in all languages. His voice caused all meanings to be known, produced all types of happiness, demonstrated the path to liberation, proclaimed the accumulations necessary for the path, did not ignore his audience, pleased all retinues, and conformed with the teachings of all buddhas.

source: བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟ་བུའི་ཚིག་གིས་རྩྭ་འཚོང་བཀྲ་ཤིས་པ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: It was with such words, spoken in verse, that the Bodhisattva addressed the grass seller Svastika:

source: བཀྲ་ཤིས་རྩྭ་དག་ང་ལ་མྱུར་དུ་བྱིན།
en: “Svastika, quick, hand me the grass!

source: །དེ་རིང་ང་ལ་རྩྭས་ནི་དོན་ཆེན་འགྱུར།
en: Today this grass will be very meaningful to me.

source: །དཔུང་དང་བཅས་པའི་བདུད་ནི་བཅོམ་ནས་སུ།
en: Once I have conquered Māra and his armies,

source: །བྱང་ཆུབ་དམ་པ་ཞི་བ་རེག་པར་འགྱུར།
en: I will experience the peace of unexcelled awakening.

source: །གང་གི་ཆེད་དུ་ང་ཡིས་བསྐལ་སྟོང་དུ།
en: “That peace, for the sake of which, for many thousands of eons,

source: །སྦྱིན་དང་དུལ་དང་སྡོམ་དང་གཏོང་བྱས་དང་། །ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་རབ་སྤྱད་པ།
en: I have practiced generosity, constraint, renunciation, And ethical and disciplined conduct, as well as austerities—

source: །དེ་ནི་དེ་རིང་ང་ཡིས་ཐོབ་པར་འགྱུར།
en: That peace will come to fruition today.

source: །བཟོད་པའི་སྟོབས་དང་དེ་བཞིན་བརྩོན་འགྲུས་སྟོབས།
en: “The power of forbearance and the power of diligence,

source: །བསམ་གཏན་སྟོབས་དང་དེ་བཞིན་ཤེས་རབ་སྟོབས།
en: The power of concentration and the power of insight‌,

source: །བསོད་ནམས་དང་ནི་མངོན་ཤེས་རྣམ་ཐར་སྟོབས།
en: The power of merit, the power of realization, and the power of liberation—

source: །དེ་ནི་དེ་རིང་ང་ལ་འགྲུབ་པར་འགྱུར།
en: Today I will accomplish those.

source: །ཤེས་རབ་སྟོབས་དང་ཐབས་ཀྱི་སྟོབས་དག་དང་། །རྫུ་འཕྲུལ་དང་ནི་ཆགས་མེད་བྱམས་པའི་སྟོབས།
en: “The power of insight‌ and the power of means, The power of miracles and unattached love,

source: །སོ་སོ་ཡང་དག་རིག་དང་བདེན་པའི་སྟོབས།
en: The power of correct discernment and complete truth—

source: །དེ་རིང་ང་ལ་རྩྭ་སྦྱིན་བྱས་ན་ནི།
en: “If today you grant me this grass,

source: །ཁྱོད་ལ་བསོད་ནམས་སྟོབས་ནི་མཐའ་ཡས་ཏེ། །དེ་ནི་ཁྱོད་ཀྱི་ངན་པའི་རྒྱུར་མི་འགྱུར།
en: You shall reap the power of limitless merit. For you this is none other than a sign heralding

source: །ཁྱོད་ཀྱང་སྟོན་པ་བླ་ན་མེད་པར་འགྱུར།
en: That you will become an unsurpassed teacher!”

source: །བཀྲ་ཤིས་པས་ནི་འདྲེན་པའི་ཚིག་སྙན་རབ་ཏུ་མཛེས་ཐོས་ནས།
en: Svastika, hearing these beautiful and sweet words spoken by the Guide,

source: །དགའ་ཞིང་མགུ་ལ་ཡིད་རངས་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་ནི།
en: Became joyful, elated, and thrilled with delight.

source: །རྩྭ་འཇམ་གཞོན་ཞིང་བཟང་ལ་རེག་པར་ལྡན་པ་སྤར་གང་ཐོགས།
en: Taking a sheaf of soft, fresh, and tender grass,

source: །མདུན་དུ་འདུག་ནས་རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་འདི་སྐད་སྨྲས།
en: He stood before the Bodhisattva and spoke these words, his heart overflowing with joy:

source: །གལ་ཏེ་རྩྭ་ཡིས་བྱང་ཆུབ་གོ་འཕང་དམ་པ་འཆི་མེད་པ།
en: “If this grass can help you attain the supreme state of immortality—

source: །མཆོག་གྱུར་ཞི་བ་བལྟ་དཀའ་སྔོན་གྱི་རྒྱལ་བའི་ལམ་འཐོབ་ན།
en: The awakening, supremely peaceful, so hard to find, the path that previous buddhas traversed—

source: །ཡོན་ཏན་ཆེན་པོའི་རྒྱ་མཚོ་གྲགས་པ་དཔག་མེད་ཁྱོད་བཞེས་ཤིག །བདག་གིས་གོ་འཕང་དམ་པ་འཆི་མེད་ཐོག་མར་འཚང་རྒྱར་བགྱི།
en: Then please wait a moment, O Great Ocean of Qualities of Immeasurable Glory. I myself shall awaken first to the supreme state of immortality.”

source: བརྟུལ་ཞུགས་དཀའ་ཐུབ་རྣམ་མང་བྱ་དཀའ་བསྐལ་མང་མ་སྤྱད་པར།
en: “Svastika, without practicing disciplined conduct and austerities for many eons,

source: །བཀྲ་ཤིས་རྩྭ་མཆོག་བཏིང་བས་བྱང་ཆུབ་འདི་ནི་འཐོབ་མི་འགྱུར།
en: You will not attain awakening by sitting on a seat of fine grass.

source: །གང་ཚེ་བློ་གྲོས་ལྡན་པ་ཤེས་རབ་བསོད་ནམས་ཐབས་ཀྱིས་འཕགས།
en: Yet when an intelligent person is elevated through the tools of insight‌ and merit,

source: །དེ་ནས་རྒྱལ་བ་ཐུབ་པས་རྡུལ་མེད་འགྱུར་ཞེས་ལུང་སྟོན་ཏོ།
en: Then the sages make a prediction and say, ‘You will later become a stainless victorious one.’

source: །བཀྲ་ཤིས་གལ་ཏེ་བྱང་ཆུབ་སྐྱེ་བོ་གཞན་ལ་སྦྱིན་ནུས་ན།
en: “Svastika, if it were possible to hand awakening to another being

source: །སྲོག་ཆགས་བསྡུ་བ་བྱས་ཏེ་སྦྱིན་པར་ཡིད་གཉིས་ཁྱོད་མ་ཟ།
en: By making awakening into a lump of alms food, I would surely grant this to everyone!

source: །གང་ཚེ་ང་ཡིས་བྱང་ཆུབ་ཐོབ་ཤེས་བདུད་རྩི་རྣམ་པར་དབྱེས།
en: When I attain awakening, you should know that I will distribute immortality.

source: །ཁྱོད་འོངས་ཆོས་ཀྱི་དམ་པ་ཉོན་དང་རྡུལ་དང་བྲལ་བར་འགྱུར།
en: You must come, listen, and apply yourself to the teaching, and then you will become stainless.”

source: །འདྲེན་པས་ཤིན་ཏུ་མཆོག་ཏུ་འཇམ་པའི་རྩ་ནི་སྤར་གང་བླངས།
en: The Guide took a bundle of soft and perfect grass;

source: །སེང་གེ་ངང་པའི་སྟབས་ཀྱིས་ཆས་ནས་ས་ནི་རབ་ཏུ་གཡོས།
en: As he departed with the stride of a lion and a swan, the earth shook.

source: །ལྷ་ཀླུ་ཚོགས་རྣམས་ཐལ་མོ་སྦྱར་ཏེ་རབ་ཏུ་དགའ་ཡིད་ཀྱིས།
en: The multitudes of gods and nāgas joined their palms, rejoiced, and thought,

source: །དེང་འདིས་བདུད་དཔུང་བཅོམ་ནས་བདུད་རྩི་རེག་པར་འགྱུར་སྙམ་སེམས།
en: “Today he will conquer the hordes of demons and gain immortality!”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འགྲོ་བ་ན་ལྷའི་བུ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེང་འདིར་འདུག་ནས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་ཞིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་སྙམ་སྟེ།
en: Monks, as the Bodhisattva was walking toward the Bodhi tree, the gods and bodhisattvas realized that this was the moment when the Bodhisattva, having sat there, would attain awakening and become a truly perfect awakened one.

source: བྱང་ཆུབ་ཀྱི་ཤིང་བརྒྱད་ཁྲི་བརྒྱན་པར་གྱུར་ཏོ།
en: Accordingly, they decided to decorate another eighty thousand bodhi trees.

source: །དེ་ནས་བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་མེ་ཏོག་གི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་བརྒྱ་པ་ཡང་ཡོད།
en: Some of the bodhi trees were made of flowers and were one hundred thousand leagues high.

source: བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་སྤོས་ཀྱི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་སྟོང་པ་ཡང་ཡོད།
en: Other bodhi trees were made of odoriferous substances and were two hundred thousand leagues high.

source: བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་ཙན་དན་གྱི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་འབུམ་པ་ཡང་ཡོད།
en: Some bodhi trees were made of sandalwood and were three hundred thousand leagues high.

source: བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་གོས་ཀྱི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་ལྔ་འབུམ་པ་ཡང་ཡོད།
en: Still other bodhi trees were made of cloth and were five hundred thousand leagues high.

source: བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་རིན་པོ་ཆེའི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་འབུམ་ཕྲག་བཅུ་པ་ཡང་ཡོད།
en: Some bodhi trees were made of jewels and were one million leagues high.

source: བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཅན་ལ་འཕང་དུ་དཔག་ཚད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་པ་ཡང་ཡོད་དོ།
en: Other bodhi trees were made of all sorts of jewels and were one trillion leagues high.

source: །བྱང་ཆུབ་ཀྱི་ཤིང་དེ་དག་ཐམས་ཅད་ཀྱི་དྲུང་ན་ཡང་ཇི་ལྟར་འདུག་པའི་སེང་གེའི་ཁྲི་ལྷའི་རས་བཅོས་བུ་སྣ་ཚོགས་བཏིང་བ་བཤམས་པར་གྱུར་ཏོ།
en: At the root of each of these bodhi trees, they erected a suitable lion throne draped in various kinds of divine cloth.

source: །བྱང་ཆུབ་ཀྱི་ཤིང་ཁ་ཅིག་གི་དྲུང་དུ་ནི་པད་མའི་ཁྲི་སྟན་བཤམས་པར་གྱུར་ཏོ། །ཁ་ཅིག་གི་དྲུང་དུ་ནི་སྤོས་ཀྱི་ཁྲི་སྟན་ནོ། །ཁ་ཅིག་གི་དྲུང་དུ་ནི་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཁྲི་སྟན་ནོ།
en: By some of the bodhi trees they also prepared a lotus throne, or a throne made of fragrant substances, or a throne made of various precious materials.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་རོལ་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: The Bodhisattva now rested evenly in the absorption known as playful array.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རོལ་པ་བཀོད་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པའི་ལུས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་གི་སེང་གེའི་ཁྲི་དེ་དག་ཐམས་ཅད་ལ་འདུག་པར་ཀུན་ཏུ་སྣང་སྟེ།
en: As soon as the Bodhisattva began to rest in this absorption of playful array, immediately an identical bodhisattva appeared, with his body beautifully adorned with all the excellent marks and representations, sitting upon each of the lion thrones at the root of each of the bodhi trees.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། ལྷའི་བུ་སོ་སོའི་ཡིད་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་ཉིད་ཀྱི་སེང་གེའི་ཁྲི་ལ་སྙོམས་པར་ཞུགས་ཤིང་འདུག་གི་གཞན་གྱི་ཁྲི་ལ་ནི་མ་ཡིན་པར་ཤེས་སོ།
en: At that point the bodhisattvas and the gods each perceived that the Bodhisattva was resting in equilibrium upon their particular lion throne and not on those set forth by the others.

source: །ཇི་ལྟར་དེ་དག་གིས་ཤེས་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རོལ་པ་བཀོད་པ་འདི་ཉིད་ཀྱི་མཐུས་སེམས་ཅན་དམྱལ་བ་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་ཐམས་ཅད་དང་། ལྷ་དང་མི་ཐམས་ཅད་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་སེང་གེའི་ཁྲི་ལ་འདུག་པར་མཐོང་ངོ་།
en: The power of the Bodhisattva’s absorption of playful array produced similar perceptions in the beings in hell, those born as animals, those living in the realm of the lord of death, all gods and humans, and all other beings, regardless of their form of existence. All beings now witnessed the Bodhisattva sitting on the lion throne at the root of the Bodhi tree.

source: །དེ་ལྟ་མོད་ཀྱི་འོན་ཀྱང་དམན་པ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བློ་གྲོས་ཡོངས་སུ་ཚིམ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྩྭ་སྤར་གང་ཐོགས་ཏེ། བྱང་ཆུབ་ཀྱི་ཤིང་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཤིང་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ།
en: Nevertheless, in order to also satisfy the intellect of those who lacked dedication, the Bodhisattva picked up the bundle of grass, went to the Bodhi tree, and circumambulated it seven times.

source: བདག་ཉིད་ཀྱིས་རྩྭའི་རྩེ་མོ་ནི་ནང་དུ་བསྟན། རྩ་བ་ནི་ཕྱིར་བསྟན་ནས།
en: The Lord then arranged the grass so that the ends of the grass pointed inward and the roots pointed outward.

source: རྩྭའི་གདིང་བ་ཀུན་ནས་བཟང་པོ་བཏིང་སྟེ།
en: In this way he arranged for himself a very fine seat of grass.

source: སེང་གེ་ལྟ་བུ་དང་། དཔའ་བོ་ལྟ་བུ་དང་། སྟོབས་ལྟ་བུ་དང་། བརྟན་པ་ལྟ་བུ་དང་། བརྩོན་འགྲུས་ལྟ་བུ་དང་། མཐུ་ལྟ་བུ་དང་། གླང་པོ་ལྟ་བུ་དང་། དབང་ཕྱུག་ལྟ་བུ་དང་། རང་བྱུང་ལྟ་བུ་དང་། ཡེ་ཤེས་ཅན་ལྟ་བུ་དང་། བླ་ན་མེད་པ་ལྟ་བུ་དང་། ཁྱད་པར་ལྟ་བུ་དང་། མངོན་པར་འཕགས་པ་ལྟ་བུ་དང་། གྲགས་པ་ལྟ་བུ་དང་། བརྗོད་པ་ལྟ་བུ་དང་། སྦྱིན་པ་ལྟ་བུ་དང་། ཚུལ་ཁྲིམས་ལྟ་བུ་དང་། བཟོད་པ་ལྟ་བུ་དང་། བརྩོན་འགྲུས་ལྟ་བུ་དང་། བསམ་གཏན་ལྟ་བུ་དང་། ཤེས་རབ་ལྟ་བུ་དང་། ཡེ་ཤེས་ལྟ་བུ་དང་། བསོད་ནམས་ལྟ་བུ་དང་། བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ལྟ་བུ་དང་། ཚོགས་ལྟ་བུར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་རྩྭ་བཏིང་བ་དེ་ལ་ཤར་ཕྱོགས་སུ་བལྟས་ཏེ་འདུག་ནས།
en: He then sat down like a lion, like a hero, in a powerful way, in a steady way, in a diligent way, in a forceful way, like an elephant, like a lord, in a natural manner, like a wise person, like an unsurpassed person, like a special one, like an exalted one, like a famous one, like one full of praise, like a generous person, like a disciplined person, like a forbearing person, like a diligent person, like a concentrated person, like an insightful being, in a wise manner, in a meritorious manner, like someone who has conquered the attacks of demons, and like someone who has perfected the accumulations. In this way he sat down on the grass seat and crossed his legs facing toward the east.

source: ལུས་དྲང་པོར་བསྲང་སྟེ། དྲན་པ་མངོན་དུ་བཞག་ནས་འདི་འདྲ་བའི་ཡི་དམ་བརྟན་པོ་བྱས་སོ།
en: He then straightened his back, collected himself one-pointedly, and formed this firm resolve: [T.285]

source: །སྟན་འདིར་བདག་གི་ལུས་ནི་སྐམས་ཀྱང་རུང་།
en: “On this seat my body may wither and rot,

source: །པགས་པ་རུས་པ་ཤ་རྣམས་ཞིག་ཀྱང་རུང་།
en: And my skin, my bones, and my flesh may dissolve.

source: །བསྐལ་མང་རྙེད་དཀའ་བྱང་ཆུབ་མ་ཐོབ་པར།
en: Yet until I attain awakening, so hard to find even through many eons,

source: །སྟན་འདི་ལས་ནི་ལུས་བསྐྱོད་མི་བྱའོ།
en: I will not move my body from this seat.”

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། བཅུ་དགུ་པའོ།། །། འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: This concludes the nineteenth chapter, on approaching the seat of awakening.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དང་། འདོད་པ་ན་སྤྱོད་པའི་རིས་དྲུག་གི་ལྷ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བར་ཆད་བྱེད་པ་མི་འབྱུང་གྲང་སྙམ་སྟེ།
en: Monks, as the Bodhisattva sat down at the seat of awakening, the gods of the six classes within the desire realm decided to protect the Bodhisattva from obstacles.

source: ཤར་ཕྱོགས་ལོགས་སུ་གནས་པར་གྱུར་ཏོ།
en: These gods therefore took position in the eastern direction.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་། བྱང་ཕྱོགས་ཀྱང་ལྷ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྲུངས་པར་གྱུར་ཏོ།
en: Likewise the southern, western, and northern directions were taken over by other classes of gods.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྐུལ་བ་ཞེས་བྱ་བའི་འོད་བྱུང་ནས་འོད་དེས་ཕྱོགས་བཅུ་ཀུན་ཏུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་གྱུར་ཏོ།
en: Monks, when the Bodhisattva sat down at the seat of awakening, he began to emit a light known as inspiring the bodhisattvas. The light shone in all the ten directions, illuminating all the boundless and immeasurable buddha realms—the realms that filled the entire field of phenomena.

source: །དེ་ནས་ཤར་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་འོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བདེ་བ་བཀོད་པ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the eastern direction this light encouraged the bodhisattva, the great being, Lalitavyūha, who resided in the Vimala world in the Thus-Gone One Vimala­prabhāsa’s buddha realm.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དེའི་ཚེ་རྫུ་འཕྲུལ་གྱི་མངོན་པར་འདུ་བྱ་བ་དེ་ལྟ་བུ་བྱས་ཏེ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་དེ་བྱས་པས་ཕྱོགས་བཅུར་ནམ་མཁའི་མཐས་གཏུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་འཁོར་གྱི་ཁྱམས་བཻ་དཱུརྱ་སྔོན་པོ་དག་ལས་བྱས་པ་ཞིག་ཏུ་བསྟན་ཏོ།
en: As a way to venerate the Bodhisattva, he produced a miraculous manifestation whereby he was able to display all the buddha realms, in all directions to the end of space, as a single maṇḍala made of blue beryl.

source: །འགྲོ་བ་ལྔར་སྐྱེས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མདུན་དུ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་བསྟན་ཏོ།
en: At the same time Lalitavyūha made it so that the Bodhisattva, who was sitting at the seat of awakening, became visible to all sentient beings living in the five types of existences.

source: །སེམས་ཅན་དེ་དག་ཀྱང་ཕན་ཚུན་དུ་སོར་མོ་གཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སྟོན་ཅིང་སེམས་ཅན་ཚུལ་དུ་ཤིས་པའི་གཟུགས་འདི་ལྟ་བུ་དང་ལྡན་པ་འདི་སུ་ཞིག །འདི་ལྟར་རྣམ་པར་མཛེས་པའི་སེམས་ཅན་འདི་སུ་ཞིག་ཅེས་འཛེར་ཏོ། །སེམས་ཅན་དེ་དག་གི་མདུན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་སྤྲུལ་ཏེ།
en: These sentient beings pointed their fingers at the Bodhisattva and asked each other, “Who is this charming being? Who is that beautiful person?” Then the Bodhisattva emanated other bodhisattvas in front of everyone.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: The forms of these bodhisattvas then sang this verse:

source: །ཅི་ཡང་མེད་པའི་འདོད་ཆགས་ཞེ་སྡང་རྙོག་པ་གང་ཡིན་བག་ཆགས་བཅས་བཏོན་པ།
en: “He is someone free from attachment, anger, stains and their habitual tendencies.

source: །གང་གིས་ལུས་ལས་འོད་ཕྱུང་ཕྱོགས་བཅུའི་འོད་རྣམས་ཐམས་ཅད་འོད་ནི་མེད་པར་བྱས།
en: Light shines from his body in the ten directions, outshining all other lights.

source: །གང་གིས་བསོད་ནམས་ཏིང་འཛིན་ཡེ་ཤེས་ཚོགས་ནི་བསྐལ་པ་མང་པོར་ཀུན་སྤེལ་བ།
en: For many eons he increased the accumulations of merit, absorption, and wisdom;

source: །ཤཱཀྱ་ཐུབ་པ་ཐུབ་པ་ཆེན་པོ་དམ་པ་འདི་ནི་ཕྱོགས་རྣམས་ཀུན་ཏུ་མཛེས།
en: Śākyamuni, the most illustrious of great sages, now beautifies all places.”

source: །དེ་ནས་ལྷ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བཀོད་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིན་པོ་ཆེའི་གདུགས་བརྩེགས་པ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱ་བ་འོད་དེས་བསྐུལ་བས་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་འདས་པ་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: In the southern direction, the light encouraged the bodhisattva, the great being, Ratnacchattra­kūṭa­saṃdarśana, who resided in the world Ratnavyūhā of the Thus-Gone One Ratnārcis’ buddha realm. Surrounded and escorted by an infinite number of bodhisattvas, he proceeded to the seat of awakening where the Bodhisattva was sitting.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རིན་པོ་ཆེའི་གདུགས་གཅིག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱི་ཁྱམས་དེ་བཀབ་བོ།
en: As a way to venerate the Bodhisattva, he sheltered the entire area with a single jewel parasol.

source: །དེ་ན་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དག་ཕན་ཚུན་འདི་སྐད་འཛེར་ཏེ། གང་གི་ཕྱིར་རིན་པོ་ཆེའི་གདུགས་བཀོད་པ་རྣམ་པ་འདི་ལྟ་བུ་འདི་སྣང་བར་གྱུར་པ་འདི་སུའི་འབྲས་བུ་ཞེས་འཛེར་ཏོ།
en: Indra, Brahmā, and the world protectors now said to each other, “How come this jewel parasol appeared?

source: །དེ་ནས་རིན་པོ་ཆེའི་གདུགས་དེ་ལས་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་།
en: Whose karmic result is this?” At that point, this verse was heard from the jewel parasol:

source: གང་གིས་རིན་པོ་ཆེ་དང་སྤོས་གདུགས་སྟོང་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་དག །བྱམས་པའི་ཡིད་ཀྱིས་དོ་ཟླ་མེད་པར་བཞུགས་དང་མྱ་ངན་འདས་ལ་ཕུལ།
en: “He who donated trillions of jewels, fragrant substances, and parasols To those without an equal who abide, their minds full of loving kindness, in the state of passing beyond suffering,

source: །དེ་ཡིས་མཚན་མཆོག་ལྡན་པ་ཕན་མཛད་སྲེད་མེད་བུ་ཡི་མཐུ་ལྡན་པ།
en: Is the benefactor endowed with the best marks, with strength like Nārāyaṇa.

source: །ཡོན་ཏན་མངའ་བ་བྱང་ཆུབ་ཤིང་དྲུང་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱས།
en: This offering is for him, the master of good qualities, who has gone to the Bodhi tree!”
